#include <iostream>
#include <cmath> // Математична бібліотека

using namespace std;

int main()
{
	double x; // Вхідний параметр                                                             
	double z1; // Результат обчислення 1-го виразу                                                           	
	double z2; // Результат обчислення 2-го виразу

	cout << "x = "; cin >> x; // Вимагає ввести значення x
	z1 = (1 - 2 * pow(sin(x), 2)) / (1 + sin(2 * x)); // Формула обчислення 1-го виразу
	// z2 = (1 - tan(x)) / (1 + tan(x)); // Формула обчисленння 2-го виразу
	cout << "z1 = " << z1 << endl; // Вивід результату обчислення 1-го виразу
	// cout << "z2 = " << z2 << endl; // Вивід результату обчислення 2-го виразу

	return 0;
}